@melinath 

I was just experimenting with state upgraders in https://github.com/GoogleCloudPlatform/magic-modules/pull/14933/commits/b860c8cf5c5f0ac0ffeb78016a9382b21e267d79 after your comment https://github.com/GoogleCloudPlatform/magic-modules/pull/14913#issuecomment-3211184736, I was just wondering if it makes sense at all in this case to move forward with this.

With the bugged release (`v6.49.0`) there were **two serious problems**:

<hr>

**Problem 1:** the default value of `secret_data_wo_version` changed from `0` to `nil`.

This caused force replacements, even for users that didn't use the write-only variant because under-the-hood the defaults are always still set. Example of this is:

```terraform
resource "google_secret_manager_secret_version" "db_host" {
  secret      = google_secret_manager_secret.google_secret_manager_secret["DB_HOST"].id
  secret_data = google_sql_database_instance.google_sql_database_instance.ip_address[0].ip_address
}
```

causing

```
Step #2 - "tf plan":   # module.dev.google_secret_manager_secret_version.db_host must be replaced
Step #2 - "tf plan": -/+ resource "google_secret_manager_secret_version" "db_host" {
Step #2 - "tf plan":       ~ create_time            = "2025-05-30T15:52:04.734092Z" -> (known after apply)
Step #2 - "tf plan":       + destroy_time           = (known after apply)
Step #2 - "tf plan":       ~ id                     = "projects/764710828782/secrets/dev_DB_HOST/versions/1" -> (known after apply)
Step #2 - "tf plan":       ~ name                   = "projects/764710828782/secrets/dev_DB_HOST/versions/1" -> (known after apply)
Step #2 - "tf plan":       - secret_data_wo_version = "0" -> null # forces replacement
Step #2 - "tf plan":       ~ version                = "1" -> (known after apply)
Step #2 - "tf plan":         # (5 unchanged attributes hidden)
Step #2 - "tf plan":     }
```

For this a state upgrader could make sense, however, only if I am able to determine if the user defined `secret_data_wo_version` is set to "0" because of that the user explicitly set it OR because it was due to the default value. In the case of the default value, you could write a state upgrader that changes it from `0` to `nil`. However, if the user explicitly set it, you don't want to touch it. And as far I can see in the state upgrader method we can only work with raw state.

<hr>

**Problem 2:** `secret_data_wo` because "required_with" `secret_data_wo_version` (and visa versa)

This caused problems for users that were already using the write-only variant, however, relied upon the default value (`0`) of the `secret_data_wo_version`. For example for users who had something configured like:

```terraform
resource "google_secret_manager_secret_version" "db_host" {
  secret         = google_secret_manager_secret.google_secret_manager_secret["DB_HOST"].id
  secret_data_wo = google_sql_database_instance.google_sql_database_instance.ip_address[0].ip_address
  # no `secret_data_wo_version` configured, because it had default 0 anyways
}
```

However, because it had the "required_with" configured both ways, this caused problems.

```
"secret_data_wo": all of `secret_data_wo,secret_data_wo_version` must be specified
```

<hr>

I was wondering if you have an idea how we could prevent both these scenarios using a state upgrader. I think (even though it is less elegant) a solution like https://github.com/GoogleCloudPlatform/magic-modules/pull/14913 is the only way to tackle both these cases. I think the required_with case will always be a problem until a next major release.
